[
  {
    "slug": "accessibility-agents-v2-launch",
    "title": "Blind Developers Launch Open Source AI Agent Teams to Fix Accessibility Gap in AI Coding Tools",
    "date": "2026-02-25",
    "summary": "Community Access announces the public launch of Accessibility Agents -- 47 specialized AI agents, 14 knowledge modules, and 52 pre-built prompts across Claude Code, GitHub Copilot, and Claude Desktop.",
    "type": "Press Release"
  },
  {
    "slug": "test-wcag-audit-tool",
    "title": "New WCAG Audit Tool Reaches 1,000 Scans in First Week",
    "date": "2026-02-20",
    "summary": "The web accessibility wizard agent has completed over 1,000 automated WCAG 2.2 AA audits since launch, identifying more than 8,000 individual findings across community projects.",
    "type": "Announcement"
  },
  {
    "slug": "test-github-copilot-support",
    "title": "Accessibility Agents Now Available for GitHub Copilot",
    "date": "2026-02-15",
    "summary": "Community Access expands platform support with 52 pre-built prompts for GitHub Copilot, bringing automated accessibility review to millions of developers already using Copilot.",
    "type": "Press Release"
  },
  {
    "slug": "test-document-accessibility",
    "title": "Document Accessibility Wizard Ships with Word, Excel, PowerPoint, and PDF Support",
    "date": "2026-02-10",
    "summary": "The new document accessibility wizard can audit Office documents and PDFs for accessibility compliance, covering heading structure, alt text, table headers, and reading order.",
    "type": "Announcement"
  },
  {
    "slug": "test-community-milestone",
    "title": "Community Access Reaches 500 GitHub Stars",
    "date": "2026-02-05",
    "summary": "The Community Access organization crosses 500 stars on GitHub as more developers discover the open source accessibility agents project.",
    "type": "Milestone"
  },
  {
    "slug": "test-contrast-master",
    "title": "Contrast Master Agent Catches Color Failures Before They Ship",
    "date": "2026-01-28",
    "summary": "The contrast-master agent now validates color tokens in design systems including Tailwind, MUI, Chakra UI, and Style Dictionary configurations at the source level.",
    "type": "Announcement"
  },
  {
    "slug": "test-keyboard-navigator",
    "title": "Keyboard Navigator Agent Adds Focus Trap Detection",
    "date": "2026-01-20",
    "summary": "The keyboard-navigator agent can now detect and flag focus traps, missing skip links, and broken tab order in single-page applications automatically.",
    "type": "Announcement"
  },
  {
    "slug": "test-mobile-accessibility",
    "title": "Mobile Accessibility Agent Launches for React Native and SwiftUI",
    "date": "2026-01-15",
    "summary": "A new mobile accessibility specialist agent reviews React Native, Expo, SwiftUI, and UIKit code for touch target sizes, screen reader labels, and platform-specific semantics.",
    "type": "Press Release"
  },
  {
    "slug": "test-epub-support",
    "title": "ePub Accessibility Scanning Now Available",
    "date": "2026-01-10",
    "summary": "Community Access adds ePub document scanning with EPUB Accessibility 1.1 conformance checks including navigation, reading order, alt text, and accessibility metadata.",
    "type": "Announcement"
  },
  {
    "slug": "test-open-source-launch",
    "title": "Community Access Goes Open Source",
    "date": "2025-12-20",
    "summary": "Taylor Arndt and Michael Babcock open source the accessibility agents project under the MIT license, making the full agent suite freely available to all developers.",
    "type": "Press Release"
  },
  {
    "slug": "test-first-contributors",
    "title": "First External Contributors Join the Project",
    "date": "2025-12-10",
    "summary": "Community Access welcomes its first wave of external contributors, with pull requests improving ARIA patterns, form validation, and dark mode contrast checks.",
    "type": "Milestone"
  },
  {
    "slug": "test-early-preview",
    "title": "Early Preview of Accessibility Agents Available for Testing",
    "date": "2025-11-25",
    "summary": "An early preview build of the accessibility agents is now available for developers who want to test automated WCAG audits in their Claude Code workflows.",
    "type": "Announcement"
  },
  {
    "slug": "test-project-announcement",
    "title": "Announcing Community Access: AI-Powered Accessibility for Everyone",
    "date": "2025-11-01",
    "summary": "Two blind developers announce Community Access, a new open source project building AI agent teams that make accessibility the default in software development.",
    "type": "Press Release"
  }
]
